# 자료형 : 03. 문자열
# 문자열(String) :''로 사용, ""로 사용해도 동일
    # 단 '로 시작하면 '로, "로 시작하면 "로 끝내야함
    # 문자열 연산 = 문자열 연결(String Concatenation)
print("파이썬 공부")
print("자료형 - 문자열")
    # 연습 문제
print("I'm excited to learn Python!")
print('I\'m \"excitied\" to learn Python!')
print("Hello" + "Future")
print("Hello" * 3)
print("3"+"5")

# 예제 (04. 문자열 연습)
    # print 함수와 문자열 개념을 이용해서 다음 두 문장을 출력하세요.

    # '응답하라 1988'은 많은 시청자들에게 사랑을 받은 드라마예요.
    # 데카르트는 "나는 생각한다. 고로 존재한다."라고 말했다.
print('\'응답하라 1988\'은 많은 시청자들에게 사랑을 받은 드라마예요')
print("데카르트는 \"나는 생각한다. 고로 존재한다.\"라고 말했다.")
        # 혹은 이렇게 간단하게도 가능하다
print("'응답하라 1988'은 많은 시청자들에게 사랑을 받은 드라마예요.")
print('데카르트는 "나는 생각한다. 고로 존재한다."라고 말했다.')

# 예제 (05. 문자열 연습)
    # print 함수와 문자열 개념을 이용해서 다음 문장을 출력하세요.

    # 영화 '신세계'에서 "드루와~"라는 대사가 유행했다.
print('영화 \'신세계\'에서 "드루와~"라는 대사가 유행했다.')
